"KEY"                     = "芬兰语";
"OK"                      = "OK";
"Back"                    = "Takaisin";
"Done"                    = "Tehty";
"Edit"                    = "Muokata";
"Sorry"                   = "Anteeksi";
"Cancel"                  = "Peruuttaa";
"Setting"                 = "Asetus";
"Photos"                  = "Kuvat";
"Videos"                  = "Videot";
"Preview"                 = "Esikatselu";
"Full image"              = "Koko kuva";
"Processing..."           = "Käsitellään...";
"No Photos or Videos"     = "Ei kuvia tai videoita";
"Synchronizing photos from iCloud" = "Kuvien synkronointi iCloudista";
"iCloud sync failed"    = "iCloud-synkronointi epäonnistui";
"Can not use camera"      = "Kameraa ei voi käyttää";
"Can not choose both video and photo" = "Ei voi valita sekä videota että valokuvaa";
"Can not choose both photo and GIF" = "Ei voi valita sekä valokuvaa että GIF-tiedostoa";
"Select the video when in multi state, we will handle the video as a photo" = "Valitse video, kun se on monitilassa, käsittelemme videon valokuvana";
"Can not jump to the privacy settings page, please go to the settings page by self, thank you" = "Ei voi siirtyä tietosuoja-asetussivulle. Mene itse asetussivulle, kiitos";
"Select a maximum of %zd photos" = "Valitse enintään %zd kuvaa";
"Select a minimum of %zd photos" = "Valitse vähintään %zd kuvaa";
"Allow %@ to access your album in \"Settings -> Privacy -> Photos\"" = "Salli %@ käyttää albumiasi kohdassa \"Asetukset > Tietosuoja > Kuvat\"";
"Please allow %@ to access your camera in \"Settings -> Privacy -> Camera\"" = "Anna sovelluksen %@ käyttää kameraasi kohdassa \"Asetukset > Tietosuoja > Kamera\"";
"Selected for %ld seconds" = "Valittu %ld sekunniksi";
"Allow %@ to access your all photos" = "%@ voi käyttää vain valittuja valokuvia. Salli pääsy \"kaikkiin kuviin\"";
"Add more accessible photos" = "Lisää \n lisää saatavilla olevia kuvia";
